---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSizes.GetConduitSizesIterator
source: html/7a01fb6a-00dd-5c39-3539-fd0cc1cef15b.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizes.GetConduitSizesIterator Method

Returns a ConduitSizeIterator to the conduit sizes.

## Syntax (C#)
```csharp
public ConduitSizeIterator GetConduitSizesIterator()
```